Revit 2024 API
BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfied Property
 Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EqualityConstraintsUnsatisfied { get; }
Visual Basic
Public Shared ReadOnly Property EqualityConstraintsUnsatisfied As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EqualityConstraintsUnsatisfied {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace